Tekla Open API Reference for Tekla Structures 2025
Angle.CompareTo Method
 Compares this angle with another angle
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int CompareTo(
	Angle other
)
Public Function CompareTo (
	other As Angle
) As Integer
Parameters
other
Type: Tekla.Structures.Datatype.Angle
Angle to compare to
Return Value
Type: Int32
Greater than zero if this angle is greater than other, otherwise less than zero if this angle is less than other, otherwise 0 if they are equal
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace